
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       14 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                            |
|:--------:|:-----------------------------------------------------------------------------------------------------|
|    🟢    | `aws_iam_policy.infrahouse-ubuntu-pro-permissions`                                                   |
|    🟢    | `aws_iam_role_policy_attachment.infrahouse-ubuntu-pro-permissions`                                   |
|    🟢    | `module.infrahouse-ubuntu-pro-github.aws_iam_role.github`                                            |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_key_pair.infrahouse-ubuntu-pro`                               |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_security_group.infrahouse-ubuntu-pro`                         |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro`                          |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["noble"]`    |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["oracular"]` |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_egress_rule.outbound`                      |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.icmp`                         |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.ssh`                          |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.tls_private_key.infrahouse-ubuntu-pro`                            |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.module.infrahouse-ubuntu-pro-key.aws_kms_alias.alias`             |
|    🟢    | `module.infrahouse-ubuntu-pro-uw-1.module.infrahouse-ubuntu-pro-key.aws_kms_key.main`                |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.infrahouse-ubuntu-pro-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "infrahouse-ubuntu-pro-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:SetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.infrahouse-ubuntu-pro-permissions will be created
  + resource "aws_iam_policy" "infrahouse-ubuntu-pro-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "infrahouse-ubuntu-pro-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # aws_iam_role_policy_attachment.infrahouse-ubuntu-pro-permissions will be created
  + resource "aws_iam_role_policy_attachment" "infrahouse-ubuntu-pro-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-infrahouse-ubuntu-pro-github"
    }

  # module.infrahouse-ubuntu-pro-github.aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/infrahouse-ubuntu-pro:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo infrahouse-ubuntu-pro"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-infrahouse-ubuntu-pro-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_key_pair.infrahouse-ubuntu-pro will be created
  + resource "aws_key_pair" "infrahouse-ubuntu-pro" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "infrahouse-ubuntu-pro"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_security_group.infrahouse-ubuntu-pro will be created
  + resource "aws_security_group" "infrahouse-ubuntu-pro" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "all-house-ubuntu-pro"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + vpc_id                 = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro will be created
  + resource "aws_ssm_parameter" "infrahouse-ubuntu-pro" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Input arguments for the infrahouse-ubuntu-pro packer GitHub Actions job"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "infrahouse-ubuntu-pro-args"
      + tags_all       = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["noble"] will be created
  + resource "aws_ssm_parameter" "infrahouse-ubuntu-pro-latest-image" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "The parameter to store the last known AMI for Ubuntu noble"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "infrahouse-ubuntu-pro-args-noble"
      + tags_all       = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_ssm_parameter.infrahouse-ubuntu-pro-latest-image["oracular"] will be created
  + resource "aws_ssm_parameter" "infrahouse-ubuntu-pro-latest-image" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "The parameter to store the last known AMI for Ubuntu oracular"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "infrahouse-ubuntu-pro-args-oracular"
      + tags_all       = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_egress_rule.outbound will be created
  + resource "aws_vpc_security_group_egress_rule" "outbound" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + to_port                = -1
    }

  # module.infrahouse-ubuntu-pro-uw-1.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + to_port                = 22
    }

  # module.infrahouse-ubuntu-pro-uw-1.tls_private_key.infrahouse-ubuntu-pro will be created
  + resource "tls_private_key" "infrahouse-ubuntu-pro" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.infrahouse-ubuntu-pro-uw-1.module.infrahouse-ubuntu-pro-key.data.aws_iam_policy_document.key_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "key_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Enable IAM User Permissions"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::303467602807:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Allow use of the key"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.infrahouse-ubuntu-pro-uw-1.module.infrahouse-ubuntu-pro-key.aws_kms_alias.alias will be created
  + resource "aws_kms_alias" "alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/infrahouse-ubuntu-pro"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.infrahouse-ubuntu-pro-uw-1.module.infrahouse-ubuntu-pro-key.aws_kms_key.main will be created
  + resource "aws_kms_key" "main" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Encryption key for encrypting SSM params passed to infrahouse-ubuntu-pro GitHub Actions job."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "created_by_module" = "infrahouse/key/aws"
          + "environment"       = "development"
          + "module_version"    = "0.2.0"
          + "service"           = "infrahouse-ubuntu-pro"
        }
      + tags_all                           = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/key/aws"
          + "environment"       = "development"
          + "module_version"    = "0.2.0"
          + "service"           = "infrahouse-ubuntu-pro"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDE0LCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>